In [1]:
%matplotlib inline
import pandas as pd
import seaborn as sns

In [3]:
df = pd.read_csv('data/occupations.csv', index_col=0)
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [9]:
Female = df[df['gender'] == 'F']

In [21]:
Female['occupation'].value_counts()

student          60
other            36
administrator    36
librarian        29
educator         26
writer           19
artist           13
healthcare       11
marketing        10
programmer        6
homemaker         6
none              4
salesman          3
executive         3
scientist         3
lawyer            2
entertainment     2
engineer          2
technician        1
retired           1
Name: occupation, dtype: int64

In [22]:
Male = df[df['gender'] == 'M']
Male['occupation'].value_counts()

student          136
other             69
educator          69
engineer          65
programmer        60
administrator     43
executive         29
scientist         28
technician        26
writer            26
librarian         22
entertainment     16
marketing         16
artist            15
retired           13
lawyer            10
salesman           9
doctor             7
none               5
healthcare         5
homemaker          1
Name: occupation, dtype: int64